{
  "backend/main.mo": "Motoko canister implementing user profiles, access control checks, and progress storage.",
  "feature_evidence.json": "Feature evidence report mapping features to affected frontend files and components.",
  "frontend-file-summaries.txt": "List of frontend file paths with brief descriptions for each component or hook.",
  "frontend/index.css": "Tailwind-based global theme variables and styling for light/dark modes.",
  "frontend/index.html": "HTML entry point loading fonts, setting metadata, and mounting the app root.",
  "frontend/src/App.tsx": "React root component setting up QueryClientProvider and rendering LoveGame.",
  "frontend/src/game/components/ConfettiHearts.tsx": "Renders a random falling-hearts confetti animation.",
  "frontend/src/game/components/FloatingHearts.tsx": "Displays floating animated heart elements for visual decoration.",
  "frontend/src/game/components/HeartBurst.tsx": "Shows a radial animated heart burst at given coordinates, auto‑removing after 1s.",
  "frontend/src/game/components/KeepsakeCard.tsx": "Keepsake certificate component always using DEFAULT_NAME and enabling PNG download.",
  "frontend/src/game/components/LevelTransition.tsx": "Level wrapper that re-renders children with a simple transition keyed by level.",
  "frontend/src/game/hooks/useFeedback.ts": "Hook providing audio tones and vibration feedback when enabled.",
  "frontend/src/game/levels/BonusSurpriseLevel.tsx": "Bonus level with an envelope-opening animation, timed compliments, and a continue button.",
  "frontend/src/game/levels/CatchHeartLevel.tsx": "Interactive level where players click a moving heart to gain points until unlocking the next stage.",
  "frontend/src/game/levels/PromiseRevealLevel.tsx": "Displays promise cards that unlock on click, manages background music, and triggers a heart-burst effect.",
  "frontend/src/game/levels/StartLevel.tsx": "Start screen with login/reset options and a button to begin the game, handling Internet Identity auth.",
  "frontend/src/game/levels/VictoryLevel.tsx": "Final celebration screen showing a keepsake card and a replay option with confetti and fireworks.",
  "frontend/src/game/LoveGame.tsx": "Main game controller switching between levels based on game state.",
  "frontend/src/game/types.ts": "Defines game state types, constants, and the list of promises used throughout the game.",
  "frontend/src/game/useLoveGameState.ts": "Hook managing global game state, personalization, progression, and backend sync with identity support.",
  "frontend/src/game/utils/exportKeepsakePng.ts": "Generates and downloads a keepsake PNG using a certificate background, default name, and dedication text.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refreshing dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, managing login, logout, and identity restoration.",
  "frontend/src/hooks/useQueries.ts": "Re-exports user progress hooks for easier imports across the app.",
  "frontend/src/hooks/useUserProgress.ts": "Provides React Query hooks to load and save user progress via an actor, with caching and identity checks.",
  "frontend/src/index.css": "Defines global Tailwind-based styles, color variables, animations, and themed UI effects for the app.",
  "frontend/src/main.tsx": "Bootstraps the React app, setting up React Query and Internet Identity providers.",
  "frontend/src/utils/urlParams.ts": "Utility helpers for reading, storing, and clearing URL and session parameters, including hash-based routing support.",
  "frontend/tailwind.config.js": "Configures Tailwind theme extensions, color mappings, animations, plugins, and content paths.",
  "project_state.json": "Stores the project’s state, features, and requirements, including updates about fixed-name behavior and UI changes."
}